In [1]:
import pandas as pd
import numpy as np

# Exercise 1

Imagine you have a dataset of product reviews with ratings given as strings (e.g., "5 stars", "4 stars"). You want to extract the numeric rating and then compute a standardized score.

In [2]:
reviews = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Rating': ['5 stars', '4 stars', '3 stars', '4 stars'],
    'Price': [120, 80, 50, 100]
})

In [3]:
reviews

  Product   Rating  Price
0       A  5 stars    120
1       B  4 stars     80
2       C  3 stars     50
3       D  4 stars    100

In [4]:
reviews['Numeric_rating'] = reviews['Rating'].apply(lambda x: int(x.split()[0]))

In [5]:
reviews

  Product   Rating  Price  Numeric_rating
0       A  5 stars    120               5
1       B  4 stars     80               4
2       C  3 stars     50               3
3       D  4 stars    100               4

In [6]:
reviews[['Rating_std', 'Price_std']] = reviews[['Numeric_rating', 'Price']].apply(lambda x: (x - x.mean())/x.std())

In [7]:
reviews

  Product   Rating  Price  Numeric_rating  Rating_std  Price_std
0       A  5 stars    120               5    1.224745   1.088384
1       B  4 stars     80               4    0.000000  -0.251166
2       C  3 stars     50               3   -1.224745  -1.255828
3       D  4 stars    100               4    0.000000   0.418609

In [8]:
reviews['Final_Score'] = reviews.apply(lambda x: (x['Rating_std'] + x['Price_std'])/2, axis = 1)

In [9]:
reviews

  Product   Rating  Price  Numeric_rating  Rating_std  Price_std  Final_Score
0       A  5 stars    120               5    1.224745   1.088384     1.156564
1       B  4 stars     80               4    0.000000  -0.251166    -0.125583
2       C  3 stars     50               3   -1.224745  -1.255828    -1.240286
3       D  4 stars    100               4    0.000000   0.418609     0.209305

# Exercise 2

Sales Data Analysis
Scenario
A company tracks its sales data for various products. You need to calculate revenue, profit, and profit margins and then format the results for reporting.

Dataset
Create a DataFrame with the following columns:

Product: Product name
Units Sold: Number of units sold
Price per Unit: Sale price for each unit
Cost per Unit: Cost price for each unit

In [10]:
sales = pd.DataFrame({
        'Product': ['A', 'B', 'C'],
        'Units Sold': [100, 150, 200],
        'Price per Unit': [10.00, 20.00, 15.00],
        'Cost per Unit': [5.00, 12.00, 10.00]
})

In [11]:
sales

  Product  Units Sold  Price per Unit  Cost per Unit
0       A         100            10.0            5.0
1       B         150            20.0           12.0
2       C         200            15.0           10.0

In [12]:
# Compute Total Revenue:
sales['Revenue'] = sales['Units Sold'] * sales['Price per Unit']

In [13]:
sales

  Product  Units Sold  Price per Unit  Cost per Unit  Revenue
0       A         100            10.0            5.0   1000.0
1       B         150            20.0           12.0   3000.0
2       C         200            15.0           10.0   3000.0

In [14]:
# Compute Profit:
sales['Profit'] = sales['Units Sold'] * (sales['Price per Unit'] - sales['Cost per Unit'])

In [15]:
sales

  Product  Units Sold  Price per Unit  Cost per Unit  Revenue  Profit
0       A         100            10.0            5.0   1000.0   500.0
1       B         150            20.0           12.0   3000.0  1200.0
2       C         200            15.0           10.0   3000.0  1000.0

In [16]:
# Calculate Profit Margin Percentage:
sales['Profit Margin (%)'] = round((sales['Profit']/sales['Revenue']) * 100, 0)

In [17]:
sales

,Product,Units Sold,Price per Unit,Cost per Unit,Revenue,Profit,Profit Margin (%)
0,A,100,10.0,5.0,1000.0,500.0,50.0
1,B,150,20.0,12.0,3000.0,1200.0,40.0
2,C,200,15.0,10.0,3000.0,1000.0,33.0

In [18]:
# Format Currency:
sales[['Revenue', 'Profit']] = sales[['Revenue', 'Profit']].map(lambda x: f'${x}')

In [19]:
sales

,Product,Units Sold,Price per Unit,Cost per Unit,Revenue,Profit,Profit Margin (%)
0,A,100,10.0,5.0,$1000.0,$500.0,50.0
1,B,150,20.0,12.0,$3000.0,$1200.0,40.0
2,C,200,15.0,10.0,$3000.0,$1000.0,33.0

# Exercise 3

Scenario
A company wants to adjust employee salaries based on their performance scores. Depending on the score, a bonus percentage is applied.

Dataset
Create a DataFrame with:

Employee: Employee name
Performance Score: A numeric score
Salary: Current salary

In [20]:
employees = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Performance Score': [92, 85, 78, 95],
    'Salary': [70000, 65000, 60000, 72000]
})

In [21]:
employees

  Employee  Performance Score  Salary
0    Alice                 92   70000
1      Bob                 85   65000
2  Charlie                 78   60000
3    Diana                 95   72000

In [22]:
# bonus percentage
employees['Bonus (%)'] = employees['Performance Score'].apply(lambda x: 10 if x >= 90 else (5 if x >= 80 else 2))

In [23]:
employees

  Employee  Performance Score  Salary  Bonus (%)
0    Alice                 92   70000         10
1      Bob                 85   65000          5
2  Charlie                 78   60000          2
3    Diana                 95   72000         10

In [24]:
# Compute Bonus Amount:
employees['Bonus Amount'] = employees['Salary'] * employees['Bonus (%)']/100

In [25]:
employees

  Employee  Performance Score  Salary  Bonus (%)  Bonus Amount
0    Alice                 92   70000         10        7000.0
1      Bob                 85   65000          5        3250.0
2  Charlie                 78   60000          2        1200.0
3    Diana                 95   72000         10        7200.0

In [26]:
# Calculate New Salary:
employees['New Salary'] = employees['Salary'] + employees['Bonus Amount']

In [27]:
employees

  Employee  Performance Score  Salary  Bonus (%)  Bonus Amount  New Salary
0    Alice                 92   70000         10        7000.0     77000.0
1      Bob                 85   65000          5        3250.0     68250.0
2  Charlie                 78   60000          2        1200.0     61200.0
3    Diana                 95   72000         10        7200.0     79200.0

# Exercise 4

Scenario
Data coming from various sources can be messy. You have a DataFrame with extra whitespace and inconsistent capitalization that you need to clean.

Dataset
Create a DataFrame with columns like Name and City where the entries have extra spaces and inconsistent letter casing.

In [28]:
clean = pd.DataFrame({
    'Name': ['  alice ', 'Bob', ' CHARLIE', 'diana '],
    'City': [' new york', 'LOS ANGELES ', ' Chicago', 'houston  ']
})

In [29]:
clean

       Name          City
0    alice       new york
1       Bob  LOS ANGELES
2   CHARLIE       Chicago
3    diana      houston

In [30]:
def cleaning(x):
    return x.strip().title()

In [31]:
cleaned = clean.map(cleaning)

In [32]:
cleaned

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    Diana      Houston